Revit 2027 API
ExporterIFCUtils.GetWallBaseOffset Method
 Obtains the base offset of the wall.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static double GetWallBaseOffset(
	Wall wall
)
Public Shared Function GetWallBaseOffset (
	wall As Wall
) As Double
public:
static double GetWallBaseOffset(
	Wall^ wall
)
static member GetWallBaseOffset :
        wall : Wall -> float
Parameters
wall Wall
 The wall.
Return Value
Double
 The base offset of the wall.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace